kean0048/ZCS-ROBOT-BD--SEND/tb/ZCS-ROBOT(BD)-RECV_V3.0/STM8_RECV_V1.8(T-USE-7C-CF)/USER/iostm8s105k4.h
/* Port I control register 1 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char C10         : 1;
  unsigned char C11         : 1;
  unsigned char C12         : 1;
  unsigned char C13         : 1;
  unsigned char C14         : 1;
  unsigned char C15         : 1;
  unsigned char C16         : 1;
  unsigned char C17         : 1;
} __BITS_PI_CR1;
#endif
__IO_REG8_BIT(PI_CR1,      0x502B, __READ_WRITE, __BITS_PI_CR1);

/* Port I control register 2 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char C20         : 1;
  unsigned char C21         : 1;
  unsigned char C22         : 1;
  unsigned char C23         : 1;
  unsigned char C24         : 1;
  unsigned char C25         : 1;
  unsigned char C26         : 1;
  unsigned char C27         : 1;
} __BITS_PI_CR2;
#endif
__IO_REG8_BIT(PI_CR2,      0x502C, __READ_WRITE, __BITS_PI_CR2);


/*-------------------------------------------------------------------------
 *      Port I bit fields
 *-----------------------------------------------------------------------*/
#ifdef __IAR_SYSTEMS_ICC__

#define PI_ODR_ODR0              PI_ODR_bit.ODR0
#define PI_ODR_ODR1              PI_ODR_bit.ODR1
#define PI_ODR_ODR2              PI_ODR_bit.ODR2
#define PI_ODR_ODR3              PI_ODR_bit.ODR3
#define PI_ODR_ODR4              PI_ODR_bit.ODR4
#define PI_ODR_ODR5              PI_ODR_bit.ODR5
#define PI_ODR_ODR6              PI_ODR_bit.ODR6
#define PI_ODR_ODR7              PI_ODR_bit.ODR7

#define PI_IDR_IDR0              PI_IDR_bit.IDR0
#define PI_IDR_IDR1              PI_IDR_bit.IDR1
#define PI_IDR_IDR2              PI_IDR_bit.IDR2
#define PI_IDR_IDR3              PI_IDR_bit.IDR3
#define PI_IDR_IDR4              PI_IDR_bit.IDR4
#define PI_IDR_IDR5              PI_IDR_bit.IDR5
#define PI_IDR_IDR6              PI_IDR_bit.IDR6
#define PI_IDR_IDR7              PI_IDR_bit.IDR7

#define PI_DDR_DDR0              PI_DDR_bit.DDR0
#define PI_DDR_DDR1              PI_DDR_bit.DDR1
#define PI_DDR_DDR2              PI_DDR_bit.DDR2
#define PI_DDR_DDR3              PI_DDR_bit.DDR3
#define PI_DDR_DDR4              PI_DDR_bit.DDR4
#define PI_DDR_DDR5              PI_DDR_bit.DDR5
#define PI_DDR_DDR6              PI_DDR_bit.DDR6
#define PI_DDR_DDR7              PI_DDR_bit.DDR7

#define PI_CR1_C10               PI_CR1_bit.C10
#define PI_CR1_C11               PI_CR1_bit.C11
#define PI_CR1_C12               PI_CR1_bit.C12
#define PI_CR1_C13               PI_CR1_bit.C13
#define PI_CR1_C14               PI_CR1_bit.C14
#define PI_CR1_C15               PI_CR1_bit.C15
#define PI_CR1_C16               PI_CR1_bit.C16
#define PI_CR1_C17               PI_CR1_bit.C17

#define PI_CR2_C20               PI_CR2_bit.C20
#define PI_CR2_C21               PI_CR2_bit.C21
#define PI_CR2_C22               PI_CR2_bit.C22
#define PI_CR2_C23               PI_CR2_bit.C23
#define PI_CR2_C24               PI_CR2_bit.C24
#define PI_CR2_C25               PI_CR2_bit.C25
#define PI_CR2_C26               PI_CR2_bit.C26
#define PI_CR2_C27               PI_CR2_bit.C27

#endif

/*-------------------------------------------------------------------------
 *      Port I bit masks
 *-----------------------------------------------------------------------*/
#define MASK_PI_ODR_ODR0         0x01
#define MASK_PI_ODR_ODR1         0x02
#define MASK_PI_ODR_ODR2         0x04
#define MASK_PI_ODR_ODR3         0x08
#define MASK_PI_ODR_ODR4         0x10
#define MASK_PI_ODR_ODR5         0x20
#define MASK_PI_ODR_ODR6         0x40
#define MASK_PI_ODR_ODR7         0x80

#define MASK_PI_IDR_IDR0         0x01
#define MASK_PI_IDR_IDR1         0x02
#define MASK_PI_IDR_IDR2         0x04
#define MASK_PI_IDR_IDR3         0x08
#define MASK_PI_IDR_IDR4         0x10
#define MASK_PI_IDR_IDR5         0x20
#define MASK_PI_IDR_IDR6         0x40
#define MASK_PI_IDR_IDR7         0x80

#define MASK_PI_DDR_DDR0         0x01
#define MASK_PI_DDR_DDR1         0x02
#define MASK_PI_DDR_DDR2         0x04
#define MASK_PI_DDR_DDR3         0x08
#define MASK_PI_DDR_DDR4         0x10
#define MASK_PI_DDR_DDR5         0x20
#define MASK_PI_DDR_DDR6         0x40
#define MASK_PI_DDR_DDR7         0x80

#define MASK_PI_CR1_C10          0x01
#define MASK_PI_CR1_C11          0x02
#define MASK_PI_CR1_C12          0x04
#define MASK_PI_CR1_C13          0x08
#define MASK_PI_CR1_C14          0x10
#define MASK_PI_CR1_C15          0x20
#define MASK_PI_CR1_C16          0x40
#define MASK_PI_CR1_C17          0x80

#define MASK_PI_CR2_C20          0x01
#define MASK_PI_CR2_C21          0x02
#define MASK_PI_CR2_C22          0x04
#define MASK_PI_CR2_C23          0x08
#define MASK_PI_CR2_C24          0x10
#define MASK_PI_CR2_C25          0x20
#define MASK_PI_CR2_C26          0x40
#define MASK_PI_CR2_C27          0x80


/*-------------------------------------------------------------------------
 *      Flash register definitions
 *-----------------------------------------------------------------------*/
/* Flash control register 1 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char FIX         : 1;
  unsigned char IE          : 1;
  unsigned char AHALT       : 1;
  unsigned char HALT        : 1;
} __BITS_FLASH_CR1;
#endif
__IO_REG8_BIT(FLASH_CR1,   0x505A, __READ_WRITE, __BITS_FLASH_CR1);

/* Flash control register 2 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char PRG         : 1;
  unsigned char             : 3;
  unsigned char FPRG        : 1;
  unsigned char ERASE       : 1;
  unsigned char WPRG        : 1;
  unsigned char OPT         : 1;
} __BITS_FLASH_CR2;
#endif
__IO_REG8_BIT(FLASH_CR2,   0x505B, __READ_WRITE, __BITS_FLASH_CR2);

/* Flash complementary control register 2 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char NPRG        : 1;
  unsigned char             : 3;
  unsigned char NFPRG       : 1;
  unsigned char NERASE      : 1;
  unsigned char NWPRG       : 1;
  unsigned char NOPT        : 1;
} __BITS_FLASH_NCR2;
#endif
__IO_REG8_BIT(FLASH_NCR2,  0x505C, __READ_WRITE, __BITS_FLASH_NCR2);

/* Flash protection register */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char WPB0        : 1;
  unsigned char WPB1        : 1;
  unsigned char WPB2        : 1;
  unsigned char WPB3        : 1;
  unsigned char WPB4        : 1;
  unsigned char WPB5        : 1;
} __BITS_FLASH_FPR;
#endif
__IO_REG8_BIT(FLASH_FPR,   0x505D, __READ, __BITS_FLASH_FPR);

/* Flash complementary protection register */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char NWPB0       : 1;
  unsigned char NWPB1       : 1;
  unsigned char NWPB2       : 1;
  unsigned char NWPB3       : 1;
  unsigned char NWPB4       : 1;
  unsigned char NWPB5       : 1;
} __BITS_FLASH_NFPR;
#endif
__IO_REG8_BIT(FLASH_NFPR,  0x505E, __READ, __BITS_FLASH_NFPR);

